

** navigation
   #+BEGIN_SRC emacs-lisp :tangle yes
                    (use-package helm
                         :bind (("M-x"   . helm-M-x)
                                ([f3] . helm-buffers-list)       
                                ("<Hangul> x" . helm-M-x)    
                                ))
                    (use-package projectile
                         :config
                         (projectile-mode +1))

                    (use-package helm-projectile
                         :bind    ([f5] . helm-projectile))

                    (use-package bufler
                      :custom
                      (bufler-column-name-width 70)
                      (bufler-filter-buffer-modes nil))
                    (setq org-special-ctrl-a/e (quote (t . t)))
   #+END_SRC

   #+RESULTS:
   : (t . t)

** dired
#+BEGIN_SRC emacs-lisp :tangle yes
  (load "dired+")
    (define-key dired-mode-map (kbd "<f1>") 'org-capture)
  (setq dired-auto-revert-buffer (quote dired-directory-changed-p))
  (add-hook 'dired-load-hook
            (function (lambda () (load "dired-x"))))

  (add-hook 'dired-mode-hook
            (lambda ()
              ;; Set dired-x buffer-local variables here.  For example:
              (dired-omit-mode 1)
              ))
  (setq dired-omit-verbose nil)
  ;; toggle `dired-omit-mode' with C-x M-o
  (add-hook 'dired-mode-hook #'dired-omit-mode)
  (setq dired-omit-files
        (concat dired-omit-files "\\|^.DS_STORE$\\|^.projectile$\\|^.org~$"))
                                         
#+END_SRC

#+RESULTS:
: \`[.]?#\|\`[.][.]?\'\|^.DS_STORE$\|^.projectile$\|^.org~$
** deft
#+begin_src emacs-lisp :tangle yes
       (use-package deft
         :ensure t
         :bind
            ([f8] . deft))
       (setq deft-directory "~/Dropbox/Zettelkasten/")
       (setq deft-default-extension "org")
       (setq deft-time-format " %b-%Y %H:%M")
       (setq deft-use-filename-as-title t)
       (setq deft-new-file-format "%Y%b%d")
       (setq deft-text-mode 'org-mode)
       (setq deft-file-naming-rules '((noslash . "-")
                                      (nospace . "-")
                                      (case-fn . downcase))) 
       (setq deft-recursive t)
       (setq deft-extensions '("org" "txt" "emacs" "bib" "ledger" "el" "tex"))
       (setq deft-auto-save-interval 15.0)
       (add-hook 'after-init-hook 'deft)
       (add-hook 'deft-mode-hook #'visual-line-mode)


#+end_src

#+RESULTS:
| visual-line-mode |

** functionality
#+BEGIN_SRC emacs-lisp  :tangle yes
  (use-package s)
  (use-package org
    :ensure org-plus-contrib)
  (use-package unkillable-scratch
    :config
    (unkillable-scratch 1))


  (use-package aggressive-indent
    :custom (global-aggressive-indent-mode t)
    )

  ;;(straight-use-package '(org-plus-contrib :includes org))

  (use-package smartparens 
    :defer t 
    :config
    (setq sp-show-pair-from-inside nil)
    (require 'smartparens-config)
    :diminish smartparens-mode
    :custom
    (smartparens-global-mode t))
  (sp-pair "'" nil :actions :rem)



 (setq org-modules
	 (quote
	  (ol-bibtex ol-eww org-habit org-id org-protocol ol-w3m ol-bookmark org-checklist org-depend org-registry)))
  
#+END_SRC

#+RESULTS:
| ol-bibtex | ol-eww | org-habit | org-id | org-protocol | ol-w3m | ol-bookmark | org-checklist | org-depend | org-registry |

** org-keybindings
#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "C-c C-x C-o") 'org-clock-out)
  (global-set-key (kbd "C-c <f2>") 'org-clock-out)
  (global-set-key (kbd "<f1>") 'org-capture)
  (global-set-key (kbd "C-c C-x C-j") 'org-clock-goto)

  (bind-keys

   ("C-c l" . org-store-link)
   ("C-c C-l" . org-insert-link)
   ("C-c b" . list-bookmarks)
   ("C-a" . org-beginning-of-line) 
   ("C-e" . org-end-of-line) 
   ("C-k" . org-kill-line)
   ([f1] . org-capture)
   ([f2] . org-clock-in)
   ([f4] . org-refile)
   ([f7] . org-agenda)
   ([f10] . org-tree-to-indirect-buffer)
   ([f11] . org-id-goto)

   )


#+END_SRC

#+BEGIN_SRC emacs-ilsp


  (define-key key-translation-map (kbd "C-c <up>") (kbd "🡑"))
  (define-key key-translation-map (kbd "C-c <down>") (kbd "🡓"))
  (define-key key-translation-map (kbd "C-c =") (kbd "≠"))
  (define-key key-translation-map (kbd "C-c <right>") (kbd "→"))
  (define-key key-translation-map (kbd "C-c m") (kbd "—"))
  (define-key key-translation-map (kbd "C-_") (kbd "–"))
  (define-key key-translation-map (kbd "C-c d") (kbd "Δ"))
  (define-key key-translation-map (kbd "C-c z")  (kbd "∴"))
#+END_SRC

#+RESULTS:
: [8756]
** agenda
:PROPERTIES:
:visibility: children
:END:
   #+BEGIN_SRC emacs-lisp :tangle yes
         (setq org-agenda-files
               '("~/Dropbox/Zettelkasten/inbox.org"
                 "~/Dropbox/Zettelkasten/journal.org"
                 "~/Dropbox/Zettelkasten/readings.org"
                 "~/Dropbox/Zettelkasten/cal.org"
                 "~/Dropbox/Zettelkasten/contacts.org"
                 "~/Dropbox/Zettelkasten/lis.org"
                 "~/Dropbox/Zettelkasten/recipes.org"
                 "~/Dropbox/Zettelkasten/ndd.org"
                 "~/Dropbox/Zettelkasten/personal.org"
                 "~/Dropbox/Zettelkasten/sysadmin.org"
                 ))

           (setq org-agenda-with-colors t)
           (setq org-agenda-skip-deadline-if-done t)
           (setq org-agenda-skip-timestamp-if-done t)
           (setq org-agenda-skip-scheduled-if-done t)
           (setq org-agenda-current-time-string "✸✸✸✸✸")
           (setq org-agenda-start-with-clockreport-mode t)
           (setq org-agenda-skip-deadline-prewarning-if-scheduled t)
           (setq org-agenda-dim-blocked-tasks t)
           (setq org-agenda-clockreport-parameter-plist
                 (quote
                  (:link t :maxlevel 4 :narrow 30 :tags t :tcolumns 1 :indent t :hidefiles t :fileskip0 t)))

     (setq org-todo-keywords
             (quote
              ((sequence "TODO(t)" "NEXT(n)" "IN-PROG(i)" "WAIT(w)" "|" "DONE(d)"  "x(c)" )
               (type "AREA(a)"  "습관(h)"   "HOLD(l)"  "|" "DONE(d)")     )))

#+END_SRC

#+RESULTS:
| sequence | TODO(t) | NEXT(n) | IN-PROG(i) | WAIT(w) |   |         | DONE(d) | x(c) |
| type     | AREA(a) | 습관(h) | HOLD(l)    |         |   | DONE(d) |         |      |



** org-capture
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-capture-templates
        '(
          ("a" "current activity" entry (file+olp+datetree "~/Dropbox/Zettelkasten/journal.org") "** %? \n" :clock-in t :clock-keep t :kill-buffer nil ) 

          ("c" "calendar" entry (file "~/Dropbox/Zettelkasten/cal.org") "* %^{EVENT}\n%^t\n%a\n%?")

          ("e" "emacs log" item (id "config") "%U %a %?" :prepend t) 

          ("f" "Anki basic" entry (file+headline "~/Dropbox/Zettelkasten/anki.org" "Dispatch Shelf") "* %<%H:%M>   \n:PROPERTIES:\n:ANKI_NOTE_TYPE: Basic (and reversed card)\n:ANKI_DECK: Default\n:END:\n** Front\n%^{Front}\n** Back\n%^{Back}%?")

          ("F" "Anki cloze" entry (file+headline "~/Dropbox/Zettelkasten/anki.org" "Dispatch Shelf") "* %<%H:%M>   \n:PROPERTIES:\n:ANKI_NOTE_TYPE: Cloze\n:ANKI_DECK: Default\n:END:\n** Text\n%^{Front}%?\n** Extra")

          ("j" "journal" entry (file+olp+datetree "~/Dropbox/Zettelkasten/journal.org") "** journal :journal: \n%U  \n%?\n\n"   :clock-in t :clock-resume t :clock-keep nil :kill-buffer nil :append t) 

          ("t" "todo" entry (file "~/Dropbox/Zettelkasten/inbox.org") "* TODO %? \nSCHEDULED: %t\n%a\n" :prepend nil)

          ("w" "org-protocol" entry (file "~/Dropbox/Zettelkasten/inbox.org")
           "* %a \nSCHEDULED: %t %?\n%:initial" )
          ("x" "org-protocol" entry (file "~/Dropbox/Zettelkasten/inbox.org")
           "* TODO %? \nSCHEDULED: %t\n%a\n\n%:initial" )

          ("y" "org-protocol" item (id "resources")
           "[ ] %a %U %:initial" )

          ))



#+END_SRC

#+RESULTS:
| a         | current activity | entry       | (file+olp+datetree ~/Dropbox/Zettelkasten/journal.org) | ** %?        |     |
| :clock-in | t                | :clock-keep | t                                                      | :kill-buffer | nil |
| c         | calendar         | entry       | (file ~/Dropbox/Zettelkasten/cal.org)                  | * %^{EVENT}  |     |

removed templates:
- ("d" "download" table-line (id "reading") "|%^{Author} | %^{Title} | %^{Format}|"  )
- ("l" "look up" item (id "5br4n6815pi0") "[ ] %? %U %a" :prepend nil)
- ("s" "to buy" item (id "shopping") "[ ] %?" :prepend t)
- ("z" "zettel" entry (file "~/Dropbox/Zettelkasten/zettels.org") "* %^{TOPIC}\n%U\n %? \n%a\n\n\n" :prepend nil :unarrowed t)
-           ("m" "meditation" table-line (id "meditation") "|%u | %^{Time} | %^{Notes}|" :table-line-pos "II-1" )





(use-package org-plus-contrib)
#+RESULTS:
** anki
  #+BEGIN_SRC emacs-lisp :tangle yes
(use-package anki-editor
  :after org
  :hook (org-capture-after-finalize . anki-editor-reset-cloze-number) ; Reset cloze-number after each capture.
  :config
  (setq anki-editor-create-decks t)
  (defun anki-editor-cloze-region-auto-incr (&optional arg)
    "Cloze region without hint and increase card number."
    (interactive)
    (anki-editor-cloze-region my-anki-editor-cloze-number "")
    (setq my-anki-editor-cloze-number (1+ my-anki-editor-cloze-number))
    (forward-sexp))
  (defun anki-editor-cloze-region-dont-incr (&optional arg)
    "Cloze region without hint using the previous card number."
    (interactive)
    (anki-editor-cloze-region (1- my-anki-editor-cloze-number) "")
    (forward-sexp))
  (defun anki-editor-reset-cloze-number (&optional arg)
    "Reset cloze number to ARG or 1"
    (interactive)
    (setq my-anki-editor-cloze-number (or arg 1)))
  (defun anki-editor-push-tree ()
    "Push all notes under a tree."
    (interactive)
    (anki-editor-push-notes '(4))
    (anki-editor-reset-cloze-number))
  ;; Initialize
  (anki-editor-reset-cloze-number)
  )
  #+END_SRC

  #+RESULTS:
  | anki-editor-reset-cloze-number |
  :after org

  ; Reset cloze-number after each capture.

  :hook (org-capture-after-finalize . anki-editor-reset-cloze-number)
  #+RESULTS:


